# EditorInteraction Constructor (EditorInteractionType) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EditorInteraction Constructor (EditorInteractionType)
EditorInteraction Class See Also
---
Construct the interaction with the specified type.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public EditorInteraction(
	EditorInteractionType interactionType
)
```

Visual Basic
---
```text
Public Sub New ( _
	interactionType As EditorInteractionType _
)
```

Visual C++
---
```text
public:
EditorInteraction(
	EditorInteractionType interactionType
)
```

# ### Parameters
interactionType
    Type: Autodesk.Revit.UI..::..EditorInteractionType
# See Also
EditorInteraction Class
EditorInteraction Overload
Autodesk.Revit.UI Namespace